# "======Логические операторы======"
# # логические операторы - это выражения, которые возвращает True, если правда, False - если ложь

# 5 == 5 # True
# 4 == 5 # False

# 5 != 5 # False
# 5 != 2 # True

# 5 > 10 # False
# 10 > 5 # True
# 5 > 5 # False

# 5 < 10 # True
# 10 < 5 # False
# 5 < 5 # False

# 5 <= 10 # True
# 10 <= 5 # False
# 5 <= 5 # True

# 5 >= 10 # False
# 10 >= 5 # True
# 5 >= 5 # True


"==========FizzBuzz========="
# если число кратно 3 - вывести Fizz
# если число кратно 5 - вывести Buzz
# если число кратно и 5 и 3 - вывести FizzBuzz
# если число не кратно ни 5 ни 3 - вывести число

# for i in range(1, 101):
#     if i % 3 == 0 and i % 5 == 0:
#         print('FizzBuzz')
#     elif i % 3 == 0:
#         print('Fizz')
#     elif i % 5 == 0:
#         print('Buzz')
#     else:
#         print(i)

# for i in range(1, 101):
#     if i % 3 == 0:
#         if i % 5 ==0:
#             print("FizzBuzz")
#         else:
#             print("Fizz")
#     elif i % 5 == 0:
#         print('Buzz')
#     else:
#         print(i)

"=====Условные операторы======"
# условные операторы нужны для того, чтобы при разных входных данных код работал по-разному

# if условие1:
#     тело1
# elif условие2:
#     тело2
# else:
#     тело3


























